In [279]:
import os
import glob
import pandas as pd

In [246]:
pd.set_option('display.max_rows', 9)
pd.set_option('display.max_columns', 90)

In [280]:
!pwd

/Users/AnthonyCelio/ad/falcon/soy

In [281]:
glob.glob(path + '*.*')

['/Users/AnthonyCelio/ad/falcon/soy/temps/Soy_country_Temps_1901_2015.csv',
 '/Users/AnthonyCelio/ad/falcon/soy/temps/GREENFIELD-8-30-2018.csv',
 '/Users/AnthonyCelio/ad/falcon/soy/temps/MEMPHIS_8-30-2018.csv',
 '/Users/AnthonyCelio/ad/falcon/soy/temps/SIOUX_FALLS.csv',
 '/Users/AnthonyCelio/ad/falcon/soy/temps/Memphis_USA_Temp.csv',
 '/Users/AnthonyCelio/ad/falcon/soy/temps/GREENFIELD.csv']

In [282]:
path = '/Users/AnthonyCelio/ad/falcon/soy/temps/'

In [298]:
memphis = pd.read_csv('/Users/AnthonyCelio/ad/falcon/soy/temps/Memphis_USA_Temp.csv')
soux = pd.read_csv('/Users/AnthonyCelio/ad/falcon/soy/temps/SIOUX_FALLS.csv')
indianap = pd.read_csv('/Users/AnthonyCelio/ad/falcon/soy/temps/GREENFIELD.csv')
#others = pd.read_csv('/Users/AnthonyCelio/ad/falcon/soy/temps/Soy_country_Temps_1901_2015.csv')

In [299]:
#others = others.iloc[::-1]
memphis = memphis.iloc[::-1]
indianap = indianap.iloc[::-1]
soux = soux.iloc[::-1]

In [300]:
#others = others.reset_index(drop=True)
memphis = memphis.reset_index(drop=True)
indianap = indianap.reset_index(drop=True)
soux = soux.reset_index(drop=True)

In [301]:
#First Date 1961-12-31

In [302]:
#others = others.loc[:647].copy()
w_dates = pd.date_range(start='1962-1-1', end='2015-12-1', freq='MS')
w_dates = pd.DataFrame(w_dates)
w_dates = w_dates[::-1]
w_dates = w_dates.reset_index(drop=True)
w_dates.rename(columns={0: 'Date'}, inplace=True)
# others = others[['Argentina_Temp', 'Brazil_Temp', 'China_Temp', 'India_Temp', 'Paraguay_Temp']].copy()
# others = w_dates.merge(other, how='outer', left_index=True, right_index=True)
# others.loc[647, 'Date'] = (pd.to_datetime('1961-12-31'))

In [303]:
memphis = memphis[['DATE', 'TMAX', 'TMIN']].copy()
indianap = indianap[['DATE', 'TMAX', 'TMIN']].copy()
soux = soux[['DATE', 'TMAX', 'TMIN']].copy()

In [304]:
memphis.rename(columns={'DATE': 'Date', 'TMAX': 'memphis_H', 'TMIN': 'memphis_L'}, inplace=True)
indianap.rename(columns={'DATE': 'Date', 'TMAX': 'indianap_H', 'TMIN': 'indianap_L'}, inplace=True)
soux.rename(columns={'DATE': 'Date', 'TMAX': 'soux_H', 'TMIN': 'soux_L'}, inplace=True)

In [305]:
memphis

             Date  memphis_H  memphis_L
0      2018-08-26         94         76
1      2018-08-25         91         72
2      2018-08-24         89         67
3      2018-08-23         85         65
...           ...        ...        ...
21053  1961-01-04         53         27
21054  1961-01-03         42         24
21055  1961-01-02         38         31
21056  1961-01-01         33         27

[21057 rows x 3 columns]

In [306]:
indianap

             Date  indianap_H  indianap_L
0      2018-08-27        90.0        72.0
1      2018-08-26        77.0        68.0
2      2018-08-25        76.0        60.0
3      2018-08-24        78.0        56.0
...           ...         ...         ...
20868  1961-01-04        33.0        13.0
20869  1961-01-03        31.0        27.0
20870  1961-01-02        33.0        29.0
20871  1961-01-01        35.0        25.0

[20872 rows x 3 columns]

In [310]:
ALL_Temp = soux.merge(indianap, how='left', on='Date')
ALL_Temp = ALL_Temp.merge(memphis, how='left', on='Date')

In [311]:
ALL_Temp

,Date,soux_H,soux_L,indianap_H,indianap_L,memphis_H,memphis_L
0,2018-08-29,75,49,NaN,NaN,NaN,NaN
1,2018-08-28,66,53,NaN,NaN,NaN,NaN
2,2018-08-27,78,66,90.0,72.0,NaN,NaN
3,2018-08-26,87,70,77.0,68.0,94.0,76.0
...,...,...,...,...,...,...,...
20692,1962-01-03,47,28,36.0,23.0,61.0,34.0
20693,1962-01-02,45,19,32.0,14.0,47.0,27.0
20694,1962-01-01,37,21,29.0,14.0,33.0,27.0
20695,1961-12-31,25,20,21.0,2.0,39.0,33.0

In [200]:
def  fahr_to_celsius(temp_fahr):
    """Convert Fahrenheit to Celsius   Return Celsius conversion of input"""
    temp_celsius = (temp_fahr - 32) * 5 / 9
    return temp_celsius

In [201]:
ALL_Temp["memphis_H"] = fahr_to_celsius(ALL_Temp["memphis_H"])
ALL_Temp["memphis_L"] = fahr_to_celsius(ALL_Temp["memphis_L"])
ALL_Temp["indianap_H"] = fahr_to_celsius(ALL_Temp["indianap_H"])
ALL_Temp["indianap_L"] = fahr_to_celsius(ALL_Temp["indianap_L"])
ALL_Temp["soux_H"] = fahr_to_celsius(ALL_Temp["soux_H"])
ALL_Temp["soux_L"] = fahr_to_celsius(ALL_Temp["soux_L"])

In [202]:
#First Date 1961-12-31

In [312]:
ALL_Temp.loc[ALL_Temp['Date'] == '1961-12-31']

,Date,soux_H,soux_L,indianap_H,indianap_L,memphis_H,memphis_L
20695,1961-12-31,25,20,21.0,2.0,39.0,33.0

In [313]:
ALL_Temp = ALL_Temp.loc[:23504]

In [314]:
ALL_Temp['Date'] = pd.to_datetime(ALL_Temp['Date'])

In [207]:
#oth_days = pd.DataFrame(pd.date_range(start='1961-12-31', end='2015-12-01')).iloc[::-1]

In [208]:
#oth_days = oth_days.reset_index(drop=True)

In [210]:
#oth_days.rename(columns={0: 'Date'}, inplace=True)

In [212]:
#others = oth_days.merge(others, how='left', on='Date').ffill()

In [315]:
ALL_Temp

            Date  soux_H  soux_L  indianap_H  indianap_L  memphis_H  memphis_L
0     2018-08-29      75      49         NaN         NaN        NaN        NaN
1     2018-08-28      66      53         NaN         NaN        NaN        NaN
2     2018-08-27      78      66        90.0        72.0        NaN        NaN
3     2018-08-26      87      70        77.0        68.0       94.0       76.0
...          ...     ...     ...         ...         ...        ...        ...
20692 1962-01-03      47      28        36.0        23.0       61.0       34.0
20693 1962-01-02      45      19        32.0        14.0       47.0       27.0
20694 1962-01-01      37      21        29.0        14.0       33.0       27.0
20695 1961-12-31      25      20        21.0         2.0       39.0       33.0

[20696 rows x 7 columns]

# Update Recent Tempretures

In [267]:
#ALL_Temp_Final = ALL_Temp.merge(others, how='left', on='Date')

In [268]:
ALL_Temp_Final

,Date,memphis_H,memphis_L,indianap_H,indianap_L,soux_H,soux_L,Argentina_Temp,Brazil_Temp,China_Temp,India_Temp,Paraguay_Temp
0,2018-08-26,34.444444,24.444444,25.000000,20.000000,30.000000,15.000000,NaN,NaN,NaN,NaN,NaN
1,2018-08-26,34.444444,24.444444,25.000000,20.000000,28.888889,20.555556,NaN,NaN,NaN,NaN,NaN
2,2018-08-25,32.777778,22.222222,24.444444,15.555556,28.333333,15.000000,NaN,NaN,NaN,NaN,NaN
3,2018-08-25,32.777778,22.222222,24.444444,15.555556,29.444444,13.888889,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...
23501,1962-01-03,16.111111,1.111111,2.222222,-5.000000,7.222222,-8.333333,19.9582,25.6771,-5.0665,19.2692,27.4243
23502,1962-01-02,8.333333,-2.777778,0.000000,-10.000000,6.111111,-8.333333,19.9582,25.6771,-5.0665,19.2692,27.4243
23503,1962-01-01,0.555556,-2.777778,-1.666667,-10.000000,1.666667,-7.222222,19.9582,25.6771,-5.0665,19.2692,27.4243
23504,1961-12-31,3.888889,0.555556,-6.111111,-16.666667,-3.888889,-6.666667,20.3264,25.5438,-9.2598,15.8479,27.8278

In [217]:
path

'/Users/AnthonyCelio/ad/falcon/soy/temps/'

In [316]:
ALL_Temp.to_csv('/Users/AnthonyCelio/ad/falcon/soy/00_ALL_Temp_Final.csv', index=False)